Revit 2027 API
ParameterTypeId.PointElementRotationAngle Property
 "Rotation Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointElementRotationAngle { get; }
Public Shared ReadOnly Property PointElementRotationAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointElementRotationAngle {
	ForgeTypeId^ get ();
}
static member PointElementRotationAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace